<template>
	<view class="container">
		《金豪力智能零售服务协议》(以下简称”本协议”)由金豪力智能零售的经营者(苏州金豪力智能科技有限公司)(以下又称”金豪力”)与金豪力智能零售的用户(以下简称”用户”或”您”)共同缔结，本协议具有合同效力。 为使用金豪力智能零售服务，您应当阅读并遵守本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款。限制、免责条款可能以黑体加粗形式提示您注意。如果您未满18周岁，请在法定监护人的陪同和参与下阅读本协议，并在征得您的监护人同意的前提下使用我们的服务或向我们提供信息。
		
		<view class="h3">一、协议确认</view>
		1、除非您已阅读并接受本协议所有条款，否则您无权使用金豪力提供的服务。您通过网络页面点击确认或以其他方式选择接受本协议，包括但不限于使用金豪力智能零售服务，即视为您已阅读并同意上述协议的约束。 
		<view class="br"></view>
		2、金豪力有权在必要时通过在平台发出公告等合理方式修改本协议条款。您在使用本服务时，应当及时查阅了解修改的内容，并自觉遵守本协议的相关内容。您如继续使用本服务，则视为对修改内容的认同，当发生有关争议时，以最新的服务协议为准:您在不同意修改内容的情况下，有权停止使用本协议涉及的服务。 
		<view class="br"></view>
		3、本协议包括协议正文和隐私政策，以及未来可能发布或更新的各类规则。所有规则为本协议不可分割的组成部分，与本协议具有同等法律效力。 
		<view class="br"></view>
		4、金豪力智能零售保留在法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容、取消订单的权利。
		
		<view class="h3">二、账户管理</view>
		1、用户使用金豪力智能零售服务应具备完全民事行为能力;用户若不具备前述资格，则用户的监护人应承担因此而导致的一切后果，且金豪力有权注销或永久冻结用户的账户。 
		<view class="br"></view>
		2、您注册成功后，金豪力会为您开通一个账户，作为您使用金豪力智能零售服务的唯一身份标识。该账户的所有权归金豪力（即金豪力智能零售用户ID），您仅拥有使用权。登录账户时，您可以使用您提供的手机号码或第三方账户（如微信、支付宝等）作为注册用户名进行登录，但在登录时您必须输入发送给您的短信验证码或登录密码。请您对验证码或密码加以妥善保管，切勿将验证码或密码告知他人并限制第三方使用、访问您的账户，因密码保管不善而造成的所有损失由您自行承担。 
		<view class="br"></view>
		3、您理解并同意，若您的行为违反本协议的相关规定，您的用户资格和账户可能被注销、暂时冻结或永久冻结。 
		<view class="br"></view>
		4、鉴于网络服务的特殊性，金豪力无义务审核是否是您本人使用该组用户名及密码，仅审核用户名及密码是否与后台的数据保持一致，任何人只要输入的用户名及密码与后台的数据一致，即可凭该组用户名及密码登录并获得金豪力所提供的各类服务，所以即使您认为您的账户登录行为并非您本人所为，金豪力将不承担因此而产生的任何责任。如您发现任何非法使用会员帐号或安全漏洞的情况，请立即与本公司联系。 
		<view class="br"></view>
		5、若您在金豪力成功注册账户后，连续6个月时间内未使用该账户(包括扫码，使用此账户订购商品，发表用户体验，参与商品讨论，参加金豪力智能零售的有关活动以及其他服务)，则金豪力有权清理您的账户。
		
		<view class="h3">三、隐私政策</view>
		我们将严格遵循《个人信息保护法》等相关法律法规处理您的个人数据。您的个人信息包括但不限于手机号码、注册邮箱地址、微信提供的OPENID、支付宝提供的USERID 等。
		在保留和使用您提供给金豪力的个人信息时受本司的网站、APP、小程序公布的隐私政策的约束。请阅读隐私政策，了解金豪力如何使用和保护您提供给我们的信息。在本司网站上下订单，自动售货机和智能货柜上使用微信、支付宝等扫码注册或扫码支付，即表示您同意我们根据隐私政策的条款收集、使用和传递您的信息。
		<view class="br"></view>
		1、您个人信息的收集 我们收集信息是为了向您提供更好以及更个性化的服务，并努力提高您的用户体验。我们收集信息的种类如下:
		<view class="br"></view>
		1.1、您向我们提供的信息：当您注册金豪力智能零售账户及您在使用相关金豪力智能零售服务时填写、提交及或其他任何方式提供的信息，包括您的微信OpenID或支付宝UserID、微信头像及昵称、电话号码、电子邮箱、收货地址及相关附加信息(如您地址中的所在的省份和城市、邮政编码等)，以及第三方支付机构的要求为享受互联网支付服务而需要提供的一些必要信息。您可以选择不提供某一或某些信息，但是这样可能使您无法使用金豪力智能零售的许多特色服务。请您理解，我们使用您提供的信息是为了回应您的要求，为您在金豪力智能零售购物或享受服务提供便利，完善金豪力智能零售以及与您进行信息沟通。另外，我们可能会将您所提供的信息与您的金豪力账户关联，用以识别您的身份。
		<view class="br"></view>
		1.2、我们在您使用服务过程中获得的信息为了提高服务质量和用户体验，我们会留存您使用服务以及使用方式的相关信息，这类信息包括: (1)您的浏览器和计算机上的信息。在您访问金豪力智能零售或使用金豪力服务时，金豪力系统自动接收并记录的您的浏览器和计算机上的信息(包括但不限于您的P地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据)。 (2)您的位置信息。当您下载或使用金豪力、其关联方及合作伙伴开发的应用程序,或访问移动网页使用金豪力服务时，金豪力可能会读取您的位置(大多数移动设备将允许您关闭定位服务，具体建议您联系您的移动设备的服务商或生产商)。 (3)您的设备信息。金豪力可能会读取您访问金豪力或使用金豪力服务时所使用的终端设备的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。 (4)您的行为或交易信息。金豪力可能会记录您访问金豪力或使用金豪力服务时所进行的操作以及您在金豪力网站上进行交易的相关信息。
		除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括您与我们的客服团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与金豪力的关联方、金豪力合作伙伴之间互动时我们获得的相关信息。同时，为提高您使用金豪力提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些我们认为有风险的链接URL。
		<view class="br"></view>
		1.3、来自第三方的信息指在您注册金豪力账户和使用服务过程中，您授权金豪力可向金豪力的关联方、合作伙伴获取其所收集的相关信息。这些信息包括但不限于您的身份信息、行为信息、交易信息、设备信息等，金豪力会将此类信息汇总，用于帮助金豪力向您提供更好以及更加个性化的服务或更好的预防互联网欺诈。您了解并同意，以下信息不适用本隐私政策: (1)您在使用金豪力提供的搜索服务时输入的关键字信息; (2)信用评价、违反法律法规规定或违反金豪力智能零售规则行为及金豪力已对您采取的措施; (3)应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。 (4)其他您与金豪力或金豪力的关联方所签署的协议(包括在线签署的电子协议，例如《金豪力用户协议》)以及金豪力智能零售规则中明确约定或提示您不适用本隐私政策的与您有关的信息。
		<view class="br"></view>
		2、我们对您个人信息的管理和使用为向您提供服务、提升我们的服务质量以及优化您的服务体验，我们会在符合法律规定下使用您的个人信息，并主要用于下列用途:
		<view class="br"></view>
		2.1、向您提供您使用的各项服务，并维护、改进这些服务。 
		<view class="br"></view>
		2.2、向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或在征得您同意的情况下与金豪力的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。如您不希望接收上述信息，可通过相应的退订功能进行退订。 
		<view class="br"></view>
		2.3、我们可能使用您的个人信息以验证身份、预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他金豪力用户，或我们或其关联方的合法权益。 
		<view class="br"></view>
		2.4、我们可能会将来自某项服务的个人信息与来自其他服务所获得的信息结合起来，用于为了给您提供更加个性化的服务使用，例如为让您通过购物拥有更广泛的社交圈而使用、共享或披露您的信息。 
		<view class="br"></view>
		2.5、我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，以展示我们的产品或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。 
		<view class="br"></view>
		2.6、让您参与有关我们产品及服务的调查。 
		<view class="br"></view>
		2.7、经您同意或授权的其他用途。
		<view class="br"></view>
		3、您个人信息的分享您的个人信息是我们为您提供服务的重要部分，我们会遵循法律规定对您的信息承担保密义务。除以下情形外，我们不会将您的个人信息披露给第三方:
		<view class="br"></view>
		3.1、征得您的同意或授权。 
		<view class="br"></view>
		3.2、根据法律法规的规定或行政或司法机构的要求。 
		<view class="br"></view>
		3.3、出于实现”我们对您个人信息的管理和使用”部分所述目的，或为履行我们在《金豪力用户协议》或本隐私政策中的义务和行使我们的权利，向金豪力的关联方、合作伙伴或代表金豪力履行某项职能的第三方(例如代表我们发出推送通知的通讯服务商、处理银行卡的支付机构等)分享您的个人信息。 
		<view class="br"></view>
		3.4、如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能产生的权利纠纷。 
		<view class="br"></view>
		3.5、只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。 
		<view class="br"></view>
		3.6、您出现违反中国有关法律、法规规定或者违反您与金豪力签署的相关协议(包括在线签署的电子协议)或违反相金豪力智能零售规则时需要向第三方披露的情形。 
		<view class="br"></view>
		3.7、为维护金豪力及其关联方或其他金豪力用户的合法权益。随着我们业务的发展，我们及我们的关联方有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。
		<view class="br"></view>
		4、您个人信息的安全 金豪力严格保护您的个人信息安全。我们使用各种制度、安全技术和程序等措施来保护您的个人信息不被未经授权的访问、篡改、披露或破坏。如果您对我们的个人信息保护有任何疑问，请联系我们的客服。在通过金豪力智能零售与第三方进行网上商品或服务的交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址等。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请您立即联络我们的客服，以便我们采取相应措施。
		<view class="br"></view>
		5、访问和更新您的个人信息 您可以在”个人中心”菜单中查阅您提交给金豪力的所有个人信息，你也可通过上述途径更新除实名认证信息之外的其他个人信息(您的实名认证信息是您通过实名认证时使用的姓名和身份证信息) , 如您需要变更您的实名认证信息，您可联系客服申请变更。
		<view class="br"></view>
		6、未成年人的个人信息保护 金豪力非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用金豪力服务前，应事先取得您家长或法定监护人的书面同意。金豪力根据国家相关法律法规的规定保护未成年人的个人信息。
		<view class="br"></view>
		7、通知和修订 为给你提供更好的服务，金豪力的业务将不时变化，本隐私政策也将随之调整。金豪力会通过在金豪力网站、移动端上发出更新版本并提醒您相关内容的更新，也请您访问金豪力以便及时了解最新的隐私政策。如果您对于本隐私政策或在使用金豪力服务时对于您的个人信息或隐私情况有任何问题，请联系金豪力客服并作充分描述，金豪力将尽力解决。
		
		<view class="h3">四、订单生效规则</view>
		1、您可以直接在金豪力智能零售柜与金豪力自动售货机消费、也可以通过金豪力智能零售提供的小程序下单，因连接本网站而产生的费用应由您自行承担。
		<view class="br"></view>
		2、尽管金豪力会尽力确保本网站在任何时候均可靠、可用，但因互联网固有的不稳定性，有可能在任何时候发生错误、遗漏、服务中断和延迟。我们不对本网站上包含的内容或服务的准确性、适用性、可靠性、完整性、性能、适合性、免受病毒攻击或及时性提供任何保证。
		<view class="br"></view>
		3、在适用法律允许的范围内，对于因您使用或延迟使用或无法使用平台、其内容或导至其他网站的链接造成的任何损害(包括但不限于利润损失或使用性损失)，无论其是基于合同、侵权(包括过失)或其他原因，金豪力概不承担任何责任。
		<view class="br"></view>
		4、在您线下选购或线下下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人以及设备编号及设备具体位置等信息。在提交订单之前，您将有机会检查您的选择，检查订单总价格，并纠正任何输入错误。您同意您在订单中提供的信息真实、准确，并且在所有方面不具有误导性。如果此类信息有任何更改，或者您发现此类信息在任何时候不真实、不完整或不准确，应立即通知金豪力平台客服。如果您提供的信息不真实、不完整或不准确，致使我们无法提供相应的服务，您需自行承担由此产生的所有损失。
		<view class="br"></view>
		5、由于市场变化及各种以合理商业努力难以控制的因素的影响，金豪力无法保证您提交的订单信息中希望购买的商品都会有货;如您拟购买的商品，发生缺货，您有权取消订单。
		<view class="br"></view>
		6、金豪力智能零售的所有信息仅出于要约邀请之目的，不构成要约或单边合同。您的订单构成您购买产品的要约。我们将通过发送确认电子邮件、弹窗或短信的方式及时确认收到您的订单。但请注意，此类确认电子邮件、弹窗或短信并不构成对您的订单的接受。我们保留在收到您的订单后随时接受或因为任何理由拒绝您的订单的权利。
		<view class="br"></view>
		7、只有当金豪力通过短信、弹窗或电子邮件通知您产品已发货时，该次销售才对我们具有约束力，并且您与我们之间的合同方告成立。如果您在一份订单中订购了多个产品，而我们向您发送电子邮件、弹窗或短信确认仅发运部分产品，那么我们和您之间的合同仅就该部分产品成立。这意味着如果产品在本网站上显示，但缺货或标价不准确或有其他错误描述，则我们无义务向您出售这些产品。
		<view class="br"></view>
		8、金豪力承诺所有订单的可追溯期为7天，未来将持续努力延长可追溯期。金豪力将尽最大努力保证订单的准确无误，但遇到极少数订单错误时，请务必于7天内在App、小程序里提出申诉或联系设备的运营方申诉，逾期未提出异议的视为接受所生成的订单，金豪力将不对逾期订单另行处理。
		<view class="br"></view>
		9、为提升您和其他消费者的购物体验，您同意以下行为规范：
		<view class="br"></view>
		(1)依次排队进行扫码方式进行开门选购。 (2)选购后，确认关门锁上再离开。 (3)不遮挡设备的摄像头及监控设施。 (4)不拍摄机器的固定装置、摄像头等结构。 (5)在扫码刷脸开门后，确认在关门前将将不需要的商品放回原位。 (6)在选购过程不用手、大件商品等其他物品遮挡小件商品。 (7)选购关门后，不再开门放回商品。 (8)不把随身携带的物品或其他商品放在设备货架上。 (9)不攀爬，移动或毁坏设备的门及其他固定装置和设备。 (10)知晓并理解，谁扫码或刷脸开门，将向谁收款，即使是其他人拿取商品或传递给其他人。 (11)不在未扫码、刷脸的情况下，以任何方式打开设备柜门拿取商品。 (12)不在设备上进行任何类型的测试来破坏其他人的购物体验。
		
		<view class="h3">五、商品信息</view>
		1、金豪力智能零售上的商品信息随时有可能发生变动，金豪力对此不作特别通知。金豪力将尽所有合理必要的努力使平台内展示的商品参数、说明、价格、库存等商品信息尽可能真实准确、全面详细。但由于平台上商品信息的数量极其庞大，且受互联网技术发展水平等客观因素的限制，平台显示的信息可能会有一定的滞后性或差错，对此情形您充分理解并予以谅解。如您发现商品信息错误或有疑问的，请在第一时间告知金豪力，并中止提交该订单。
		<view class="br"></view>
		2、金豪力将尽最大努力确保您所购商品价格的市场合理性，尽管如此，由于设备运营商的人为价格设置、文字描述、配图等错误及不可预见的系统故障等情形，可能出现价格误差，从而导致订单因重大误解或显失公平而无法履行的情况。若出现上述情形，建议您直接联系金豪力协商解决。
		<view class="br"></view>
		3、由于市场变化及各种以合理商业努力难以控制的因素的影响，金豪力无法承诺用户通过提交订单所希望购买的商品都会有货;用户订购的商品或服务如果发生缺货，用户和商家皆有权取消该订单。
		<view class="br"></view>
		4、如果发生了意外情况，您提交订单后，由于供应商提价、税额变化或者由于平台信息错误等造成商品价格变化，您可以通知金豪力为您取消订单。
		
		<view class="h3">六、金豪力的权利和义务</view>
		1、金豪力有义务在现有技术的基础上维护整个平台的正常运行，并努力提升和改进技术，使用户的线上线下交易活动得以顺利进行。
		<view class="br"></view>
		2、用户理解并认同，因线上交易平台的特殊性，金豪力没有义务对所有用户使用金豪力智能零售交易服务的过程及行为进行事前及实时审查。但用户在金豪力上有下列行为的，将授权金豪力可以普通、非专业人员的知识水平标准或根据自己掌握的信息进行独立判断，并有权做出相应处理，而无须事先通知用户或取得用户同意:
		<view class="br"></view>
		2.1、金豪力有权对用户的注册信息及购买行为进行查阅，如发现注册信息或购买行为中存在任何问题的，有权向用户发出询问及要求改正或者做出冻结或关闭账户、取消订单等处理;
		<view class="br"></view>
		2.2、用户违反本协议或金豪力任何规则或有违反法律法规和地方规章的行为的，金豪力有权删除其信息，禁止用户发言，限制用户订购，注销用户账户并按照相关法律规定向相关国家主管部门进行披露;
		<view class="br"></view>
		2.3、如用户在金豪力进行下列行为，金豪力有权对用户采取删除其信息、禁止用户发言、限制用户订购、冻结或注销用户账户等限制性措施:包括: (1)发布或以电子邮件或以其他方式传输存在恶意、虚假和侵犯他人人身财产权利内容的信息; (2)进行与网上购物无关或并非以购物为目的的活动，试图扰乱正常购物秩序;将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、发布、发送电子邮件或以其他方式传送; (3)干扰或破坏金豪力网站和服务或与金豪力网站和服务相连的服务器和网络; (4)发布其他违反公共利益或可能严重损害金豪力和其他用户合法利益的信息。
		<view class="br"></view>
		3、用户理解并同意，当用户涉嫌侵犯他人合法权益，金豪力有权在初步判断涉嫌侵权行为可能存在的情况下，在必要时可向权利人提供必要的已掌握的涉及用户的相关信息。
		<view class="br"></view>
		4、用户理解并同意，当国家行政、司法机关主动依职权或根据他人的投诉，调查用户在金豪力上的相关行为时，金豪力有义务予以配合，并将所掌握的信息提供给上述国家机关。
		<view class="br"></view>
		5、用户在此授予金豪力无偿、永久的独家使用权，并有权对该使用权进行再授权，以使金豪力有权在全球范围内全部或部分地使用、复制、修改、改写、发布、翻译和展示用户登记或发布在金豪力上的各类信息，或制作其派生作品，或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入金豪力其他作品内。
		<view class="br"></view>
		6、在适用法律允许的范围内，金豪力对于以下损失和损害不承担任何责任，无论其是基于陈述(欺诈性陈述除外)、侵权(包括过失)或合同的任何明示或默示条款: 6.1、合同成立时双方不能合理预见的与商品供应以及相关服务有关的任何损失或损害或者与您或收贷人对相关服务的使用有关的任何损失或损害; 6.2、利润损失、业务损失、业务中断或商机丧失。
		<view class="br"></view>
		7、金豪力仅限在”按现状”和”按现有”的基础上，向用户提供全部的信息、内容、材料、产品(包括软件)和服务。
		<view class="br"></view>
		8、不论在任何情况下，金豪力均不对由于互联网设备正常维护，互联网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，骚乱，灾难性天气(如火灾、洪水、风暴等)，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能履行或延迟履行承担责任。
		
		<view class="h3">七、用户的权利和义务</view>
		1、符合下列条件之一的个人、组织，才能申请成为金豪力智能零售用户、使用本协议项下的服务： 
		<view class="br"></view>
		1.1、年满十八周岁，并具有民事权利能力和民事行为能力的自然人； 
		<view class="br"></view>
		1.2、未满十八周岁，但监护人（包括但不仅限于父母）予以同意的自然人； 
		<view class="br"></view>
		1.3、根据中国法律、法规成立并合法存在的公司等企业法人、事业单位、社团组织和其他组织。无民事行为能力人、限制民事行为能力人以及无经营或特定经营资格的组织不当注册为用户的，其与本公司之间的协议自始无效，本公司一经发现，有权立即注销该用户。
		<view class="br"></view>
		2、用户有权按照金豪力智能零售规定的程序和要求使用金豪力智能零售向会员提供的各项网络服务，如果会员对该服务有异议，可以与金豪力智能零售联系以便得到及时解决。
		<view class="br"></view>
		3、用户在申请使用金豪力智能零售网络服务时，必须向金豪力智能零售提供准确的个人资料，如个人资料有任何变动，必须及时更新。
		<view class="br"></view>
		4、用户须同意接受金豪力智能零售通过电子邮件或其他方式向会员发送相关商业信息。
		<view class="br"></view>
		5、用户在使用金豪力智能零售服务时，必须遵守中华人民共和国相关法律法规的规定，不得利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶ 
		5.1、制作、复制、发布、传播或以其它方式传送含有下列内容之一的信息： (1)反对宪法所确定的基本原则的； (2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；损害国家荣誉和利益的； (3)煽动民族仇恨、民族歧视、破坏民族团结的； (4)破坏国家宗教政策，宣扬邪教和封建迷信的； (5)散布谣言，扰乱社会秩序，破坏社会稳定的； (6)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； (7)侮辱或者诽谤他人，侵害他人合法权利的； (8)煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的； (9)以非法民间组织名义活动的；含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。
		<view class="br"></view>
		5.2、利用金豪力智能零售服务从事以下活动： (1)未经允许，进入计算机信息网络或者使用计算机信息网络资源； (2)未经允许，对计算机信息网络功能进行删除、修改或者增加； (3)未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；故意制作、传播计算机病毒等破坏性程序；其他危害计算机信息网络安全的行为。
		<view class="br"></view>
		6、用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，您同意赔偿金豪力智能零售与合作公司、关联公司，并使之免受损害。对此，金豪力智能零售有权视用户的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、回收金豪力智能零售帐号、追究法律责任等措施。 对恶意注册金豪力智能零售帐号或利用金豪力智能零售帐号进行违法活动、捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，金豪力智能零售有权回收其帐号。同时，本公司会视司法部门的要求，协助调查。
		<view class="br"></view>
		7、用户不得对金豪力智能零售任何部分通过任何方式进行复制、拷贝、出售、转售或用于任何其它商业目的。
		<view class="br"></view>
		8、用户须对自己在使用金豪力智能零售服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在金豪力智能零售运营公司首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予金豪力智能零售运营公司等额的赔偿。
		<view class="br"></view>
		9、用户在使用过程中，因金豪力设备或运营商原因在付费后没有享受到对应的服务，可通过订单详情页电话联系运营商客服人员进行退款。如果客服人员无法操作退款，金豪力将优先从运营商的担保金中扣费来保障用户的权益。
		
		<view class="h3">八、知识产权</view>
		1、金豪力智能零售内的所有产品、技术、软件、程序、数据及其他信息(包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩版面设计、电子文档)的所有权利(包括但不限于版权、商标权、专利权、商业秘密及其他所有相关权利)均归金豪力所有， 受中国和国际知识产权法的保护。未经金豪力许可，任何人不得使用(包括但不限于通过任何机器人、爬虫等程序或设备监视、复制、传播、展示镜像、上载、下载)或用作其他用途。在金豪力上出现的其他商标是其商标权利人各自的财产，未经金豪力智能零售运营方或相关商标所有人的书面许可，任何第三方都不得使用。
		<view class="br"></view>
		2、金豪力智能零售用户发表的评论或文章仅代表作者本人观点，与金豪力立场无关。作者文责自负。
		<view class="br"></view>
		3、金豪力智能零售及其关联方有权将用户在本网站发表的商品使用体验、商品讨论或图片进行使用，授权他人使用或者与其他人台作使用，使用范围包括但不限于网站、电子杂志杂志、刊物等，使用时需为作者署名，以发表文章时注明的署名为准。文章有附带版权声明者除外。
		<view class="br"></view>
		4、用户在金豪力智能零售上发表的文章及图片(包括转贴的文章及图片)版权仅归属原作者所有，若作者有版权声明或原作从其他网站转载而附带有原版权声明者，其版权归属以附带声明为准。
		<view class="br"></view>
		5、任何转载、引用发表于金豪力智能零售的版权文章须符合以下规范: (1)用于非商业、非盈利、非广告性目的时需注明作者及文章及图片的出处为”金豪力”或”用于非商业、非盈利、非广告”; (2)用于商业、盈利、广告性目的时需征得文章或图片原作者的同意，并注明作者姓名、授权范围及原作出处”金豪力”或”用于商业、盈利、广告性目的”; (3)任何文章或图片的修改或删除均应保持作者原意并征求原作者同意，并注明授权范围。
		
		<view class="h3">九、其他</view>
		1、因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本协议所称之不可抗力意指不能预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地震、罢工、暴动、法定疾病、黑客攻击、网络病毒、电信部门技术管制、政府行为或任何其它自然或人为造成的灾难等客观情况。
		<view class="br"></view>
		2、本条款及其修订本的有效性、履行和与本条款及其修订本效力有关的所有事宜，将受中华人民共和国法律约束，任何争议仅适用中华人民共和国法律。
		<view class="br"></view>
		3、因本条款所引起的用户与本公司的任何纠纷或争议，首先应友好协商解决，协商不成的，用户在此同意将纠纷或争议提交本公司住所地有管辖权的人民法院诉讼解决。
		<view class="br"></view>
		4、用户正确提交注册程序所需的资料并确认本协议后，本协议在金豪力智能零售与用户之间成立并生效。
		<view class="br"></view>
		5、本协议生效前的注册用户只需要使用原用户名及验证码或密码登录金豪力智能零售网站重新接受并确认本协议，即可继续使用金豪力智能零售的服务。
		<view class="br"></view>
		6、协议有效期：从用户同意本协议或使用金豪力智能零售起至用户注销金豪力智能零售服务止。
		<view class="br"></view>
		7、本协议如无特殊规定，双方应当使用电子邮件方式就本协议相关事项进行联系。金豪力智能零售各相关部门的电子邮箱以在金豪力智能零售官方网站上注明的为准。
		<view class="br"></view>
		8、使用金豪力智能零售即表示接受金豪力智能零售服务协议及其所有附件。本协议的最终解释权归金豪力智能零售所有。
	</view>
</template>

<script setup>
	
</script>

<style lang="scss" scoped>
	.container {
		box-sizing: border-box;
		padding: 20rpx 25rpx;
		font-size: 30rpx;
	}
	.h3 {
		padding: 20rpx 0;
		font-weight: bolder;
	}
	.br {
		display: block;
		margin-bottom: 10rpx;
	}
</style>